#!/usr/bin/python
# -*- coding: utf-8 -*-
import re

def detag(html):
    detag = re.subn('<[^>]*>',' ',html)[0]
    return detag



html = u'因特信息服务业务（除出版、教育、医疗保健以外的内容）；第<em>一类增值电信业务中的在线数据处理与交易处理业务、国内因特网虚拟专用网业务、因特网数据中心业务；第</em>二类增值电信业务中的<em>因特网接入服务业务、</em>呼叫中心业务<em>、</em>信息服务业务（不含固定网电话信息服务和互联网信息服务）<em>（增值电信业务经营许可证有效期至2015年10月20日）</em>；利用互联网经营音乐娱乐产品，游戏产品运营，网络游戏虚拟货币发行，美术品，演出剧（节）目，动漫（画）产品，从事互联网文化产品展览、比赛活动（网络文化经营许可证有效期至201<em>6</em>年1<em>1</em>月<em>2</em>1日）<em>；</em>设计、开发、销售计算机软件；技术服务、技术培训、技术推广；经济信息咨询；利用www.baidu.com、www.hao123.com(www.hao222.net、www.hao222.com)、网站发布广告；设计、制作、代理、发布广告；货物进出口、技术进出口、代理进出口<em>；医疗软件技术开发</em>。'

print detag(html)
